Для захисту від додавання чутливої інформації у коміт.
Можна застосувати автоматичнє сканування на сікрети/паролі та ін. перед виконанням GIT COMMIT

Для цього потрібно перемістити файл "pre-commit.sh" у діректорію .git/hooks та переіменувати в "pre-commit"
перевіривши наявність прав на виконання.

При виконанні команди commit gitleaks перевірить файли, що додаються на вміст чутливої інформації і зупинить коміт, щоб не було витоку.


За замовченням перевірки включені відразу після додавання pre-commit у .git/hooks.
Щоб тимчасово відключити перевірки, потрібно виконати команду:

```shell
git config --local --bool hooks.gitleaks.enabled false
```

Щоб включити перевірки, потрібно виконати команду:
```shell
git config --local --bool hooks.gitleaks.enabled true
```

Якщо є хибні спрацювання, то можливо ігнорувати конкретні виводи, створивши файл .gitleaksignore в корені вашого репозиторію.
https://github.com/gitleaks/gitleaks/blob/master/.gitleaksignore


Видалення файла ".git/hooks/pre-commit" зупинить виконання перевірок на виток секретів перед commit.

Також можна видалити файл /usr/local/bin/gitleaks для ОС Linux.
Для MacOS видалити штатною командою.